RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/include/cy_device.h
#if defined (CY_IP_MXS28SRSS)
#define SRSS_CLK_ILO_CONFIG2                (((SRSS_Type *) SRSS)->CLK_ILO_CONFIG2)
#define SRSS_CLK_PILO_CONFIG2               (((SRSS_Type *) SRSS)->CLK_PILO_CONFIG2)
#endif
#define SRSS_CSV_HF                         (((SRSS_Type *) SRSS)->CSV_HF)
#define SRSS_CLK_SELECT                     (((SRSS_Type *) SRSS)->CLK_SELECT)
#define SRSS_CLK_TIMER_CTL                  (((SRSS_Type *) SRSS)->CLK_TIMER_CTL)
#define SRSS_CLK_IMO_CONFIG                 (((SRSS_Type *) SRSS)->CLK_IMO_CONFIG)
#define SRSS_CLK_ECO_PRESCALE               (((SRSS_Type *) SRSS)->CLK_ECO_PRESCALE)
#define SRSS_CLK_MF_SELECT                  (((SRSS_Type *) SRSS)->CLK_MF_SELECT)
#define SRSS_CSV_REF_SEL                    (((SRSS_Type *) SRSS)->CSV_REF_SEL)
#define SRSS_CSV_REF                        (((SRSS_Type *) SRSS)->CSV_REF)
#define SRSS_CSV_LF                         (((SRSS_Type *) SRSS)->CSV_LF)
#define SRSS_CSV_ILO                        (((SRSS_Type *) SRSS)->CSV_ILO)
#define SRSS_RES_CAUSE                      (((SRSS_Type *) SRSS)->RES_CAUSE)
#define SRSS_RES_CAUSE2                     (((SRSS_Type *) SRSS)->RES_CAUSE2)
#define SRSS_RES_CAUSE_EXTEND               (((SRSS_Type *) SRSS)->RES_CAUSE_EXTEND)
#define SRSS_PWR_CBUCK_CTL                  (((SRSS_Type *) SRSS)->PWR_CBUCK_CTL)
#define SRSS_PWR_CBUCK_CTL2                 (((SRSS_Type *) SRSS)->PWR_CBUCK_CTL2)
#define SRSS_PWR_CBUCK_CTL3                 (((SRSS_Type *) SRSS)->PWR_CBUCK_CTL3)
#define SRSS_PWR_CBUCK_STATUS               (((SRSS_Type *) SRSS)->PWR_CBUCK_STATUS)
#define SRSS_PWR_SDR0_CTL                   (((SRSS_Type *) SRSS)->PWR_SDR0_CTL)
#define SRSS_PWR_SDR1_CTL                   (((SRSS_Type *) SRSS)->PWR_SDR1_CTL)
#define SRSS_PWR_HVLDO0_CTL                 (((SRSS_Type *) SRSS)->PWR_HVLDO0_CTL)
#define SRSS_CLK_LP_PLL                     (((SRSS_Type *) SRSS)->CLK_LP_PLL)
#define SRSS_CLK_IHO                        (((SRSS_Type *) SRSS)->CLK_IHO)
#define SRSS_TST_XRES_SECURE                (((SRSS_Type *) SRSS)->TST_XRES_SECURE)
#define SRSS_RES_PXRES_CTL                  (((SRSS_Type *) SRSS)->RES_PXRES_CTL)
#define SRSS_WDT_CTL                        (((SRSS_Type *) SRSS)->WDT_CTL)
#define SRSS_WDT_CNT                        (((SRSS_Type *) SRSS)->WDT_CNT)
#define SRSS_WDT_MATCH                      (((SRSS_Type *) SRSS)->WDT_MATCH)
#if defined (CY_IP_MXS40SSRSS)
#define SRSS_WDT_MATCH2                      (((SRSS_Type *) SRSS)->WDT_MATCH2)
#endif

#if defined (CY_IP_MXS28SRSS)
#define SRSS_CLK_LP_PLL_CONFIG(pllNum)      (((CLK_LP_PLL_Type*) &SRSS->CLK_LP_PLL[pllNum])->PLL28LP_STRUCT.CONFIG)
#define SRSS_CLK_LP_PLL_CONFIG2(pllNum)     (((CLK_LP_PLL_Type*) &SRSS->CLK_LP_PLL[pllNum])->PLL28LP_STRUCT.CONFIG2)
#define SRSS_CLK_LP_PLL_CONFIG3(pllNum)     (((CLK_LP_PLL_Type*) &SRSS->CLK_LP_PLL[pllNum])->PLL28LP_STRUCT.CONFIG3)
#define SRSS_CLK_LP_PLL_CONFIG4(pllNum)     (((CLK_LP_PLL_Type*) &SRSS->CLK_LP_PLL[pllNum])->PLL28LP_STRUCT.CONFIG4)
#define SRSS_CLK_LP_PLL_CONFIG5(pllNum)     (((CLK_LP_PLL_Type*) &SRSS->CLK_LP_PLL[pllNum])->PLL28LP_STRUCT.CONFIG5)
#define SRSS_CLK_LP_PLL_STATUS(pllNum)      (((CLK_LP_PLL_Type*) &SRSS->CLK_LP_PLL[pllNum])->PLL28LP_STRUCT.STATUS)
#endif

#if defined (CY_IP_MXS40SSRSS)
#define SRSS_CLK_FLL_CONFIG                 (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG)
#define SRSS_CLK_FLL_CONFIG2                (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG2)
#define SRSS_CLK_FLL_CONFIG3                (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG3)
#define SRSS_CLK_FLL_CONFIG4                (((SRSS_Type *) SRSS)->CLK_FLL_CONFIG4)
#define SRSS_CLK_FLL_STATUS                 (((SRSS_Type *) SRSS)->CLK_FLL_STATUS)

#define SRSS_PWR_LVD_CTL                    (((SRSS_Type *) SRSS)->PWR_LVD_CTL)
#define SRSS_PWR_LVD_STATUS                 (((SRSS_Type *) SRSS)->PWR_LVD_STATUS)

#define SRSS_PWR_HIB_WAKE_CTL               (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CTL)
#define SRSS_PWR_HIB_WAKE_CTL2              (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CTL2)
#define SRSS_PWR_HIB_WAKE_CAUSE             (((SRSS_Type *) SRSS)->PWR_HIB_WAKE_CAUSE)
#define SRSS_RES_SOFT_CTL                   (((SRSS_Type *) SRSS)->RES_SOFT_CTL)
#endif

#define SRSS_TST_DDFT_FAST_CTL_REG          (*(volatile uint32_t *) 0x40201104U)
#define SRSS_TST_DDFT_SLOW_CTL_REG          (*(volatile uint32_t *) 0x40201108U)

#define SRSS_TST_DDFT_SLOW_CTL_MASK         (0x00001F1EU)
#define SRSS_TST_DDFT_FAST_CTL_MASK         (62U)

#if defined (CY_IP_MXS40SSRSS)
/* PPU configurations for DEEPSLEEP */
#define CY_SYSTEM_MAIN_PPU_DEEPSLEEP_MODE        PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_CPUSS_PPU_DEEPSLEEP_MODE       PPU_V1_MODE_FULL_RET
#define CY_SYSTEM_SRAM_PPU_DEEPSLEEP_MODE        PPU_V1_MODE_MEM_RET

/* PPU configurations for DEEPSLEEP-RAM */
#define CY_SYSTEM_MAIN_PPU_DEEPSLEEP_RAM_MODE    PPU_V1_MODE_MEM_RET
#define CY_SYSTEM_CPUSS_PPU_DEEPSLEEP_RAM_MODE   PPU_V1_MODE_OFF
#define CY_SYSTEM_SRAM_PPU_DEEPSLEEP_RAM_MODE    PPU_V1_MODE_MEM_RET

/* PPU configurations for DEEPSLEEP-OFF */
#define CY_SYSTEM_MAIN_PPU_DEEPSLEEP_OFF_MODE    PPU_V1_MODE_OFF
#define CY_SYSTEM_CPUSS_PPU_DEEPSLEEP_OFF_MODE   PPU_V1_MODE_OFF
#define CY_SYSTEM_SRAM_PPU_DEEPSLEEP_OFF_MODE    PPU_V1_MODE_OFF

/* System DEEPSLEEP Mode = (PPU_MAIN Mode)*/
#define CY_SYSTEM_DEEPSLEEP_PPU_MODES        ((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_MODE)
#define CY_SYSTEM_DEEPSLEEP_RAM_PPU_MODES    ((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_RAM_MODE)
#define CY_SYSTEM_DEEPSLEEP_OFF_PPU_MODES    ((uint32_t)CY_SYSTEM_MAIN_PPU_DEEPSLEEP_OFF_MODE)
#endif


/*******************************************************************************
*                PERI
*******************************************************************************/
/*******************************************************************************
*                PERI PCLK
*******************************************************************************/

#define PERI_INSTANCE_COUNT                    (1U)

#ifndef PERI0_PCLK_GROUP_NR
#define PERI0_PCLK_GROUP_NR     PERI_PCLK_GROUP_NR
#endif

#ifndef PERI1_PCLK_GROUP_NR
#define PERI1_PCLK_GROUP_NR     (0U)
#endif


