RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1B/include/cy_device.h
#define LIN_ERROR_CTL(base)                     (((LIN_Type *)(base))->ERROR_CTL)
#define LIN_TEST_CTL(base)                      (((LIN_Type *)(base))->TEST_CTL)
#endif /* CY_IP_MXLIN */

/*******************************************************************************
*                MXKEYSCAN
*******************************************************************************/
#if defined (CY_IP_MXKEYSCAN)

#define KEYSCAN_CTL(base)                       (((MXKEYSCAN_Type *)(base))->KEYSCAN_CTL)
#define KEYSCAN_DEBOUNCE(base)                  (((MXKEYSCAN_Type *)(base))->DEBOUNCE)
#define KEYSCAN_KEYFIFO_CNT(base)               (((MXKEYSCAN_Type *)(base))->KEYFIFO_CNT)
#define KEYSCAN_KEYFIFO(base)                   (((MXKEYSCAN_Type *)(base))->KEYFIFO)
#define KEYSCAN_MIA_CTL(base)                   (((MXKEYSCAN_Type *)(base))->MIA_CTL)
#define KEYSCAN_MIA_STATUS(base)                (((MXKEYSCAN_Type *)(base))->MIA_STATUS)
#define KEYSCAN_KSI_USED(base)                  (((MXKEYSCAN_Type *)(base))->KSI_USED)
#define KEYSCAN_INTR(base)                      (((MXKEYSCAN_Type *)(base))->INTR)
#define KEYSCAN_INTR_SET(base)                  (((MXKEYSCAN_Type *)(base))->INTR_SET)
#define KEYSCAN_INTR_MASK(base)                 (((MXKEYSCAN_Type *)(base))->INTR_MASK)
#define KEYSCAN_INTR_MASKED(base)               (((MXKEYSCAN_Type *)(base))->INTR_MASKED)

#endif /* CY_IP_MXKEYSCAN */

#define MPC_Type                                 RAMC_MPC_Type
#ifdef CPUSS_PC_NR
#define MPC_PC_NR                                CPUSS_PC_NR
#else
#define MPC_PC_NR                                RAMC0_MPC_PC_NR
#endif

/* This is a temporary fix as there is no IP flag to differentiate between Player and 28929 */
#ifdef MS_CTL_1_2_SECTION_SIZE
typedef MS_CTL_1_2_Type                         MS_CTL_Type;

#define MS_CTL_BASE MS_CTL_1_2_BASE
#define MS_CTL MS_CTL_1_2

/* MS_CTL.CODE_MS0_MSC_ACG_CTL */
#define MS_CTL_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos   MS_CTL_1_2_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk   MS_CTL_1_2_CODE_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Pos        MS_CTL_1_2_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Msk        MS_CTL_1_2_CODE_MS0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.SYS_MS0_MSC_ACG_CTL */
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos    MS_CTL_1_2_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk    MS_CTL_1_2_SYS_MS0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Pos         MS_CTL_1_2_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Msk         MS_CTL_1_2_SYS_MS0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.SYS_MS1_MSC_ACG_CTL */
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos    MS_CTL_1_2_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk    MS_CTL_1_2_SYS_MS1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Pos         MS_CTL_1_2_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Msk         MS_CTL_1_2_SYS_MS1_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.EXP_MS_MSC_ACG_CTL */
#define MS_CTL_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Pos     MS_CTL_1_2_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Msk     MS_CTL_1_2_EXP_MS_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_EXP_MS_MSC_ACG_CTL_SEC_RESP_Pos          MS_CTL_1_2_EXP_MS_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_EXP_MS_MSC_ACG_CTL_SEC_RESP_Msk          MS_CTL_1_2_EXP_MS_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.DMAC0_MSC_ACG_CTL */
#define MS_CTL_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Pos      MS_CTL_1_2_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Msk      MS_CTL_1_2_DMAC0_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_DMAC0_MSC_ACG_CTL_SEC_RESP_Pos           MS_CTL_1_2_DMAC0_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_DMAC0_MSC_ACG_CTL_SEC_RESP_Msk           MS_CTL_1_2_DMAC0_MSC_ACG_CTL_SEC_RESP_Msk
/* MS_CTL.DMAC1_MSC_ACG_CTL */
#define MS_CTL_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Pos      MS_CTL_1_2_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Pos
#define MS_CTL_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Msk      MS_CTL_1_2_DMAC1_MSC_ACG_CTL_CFG_GATE_RESP_Msk
#define MS_CTL_DMAC1_MSC_ACG_CTL_SEC_RESP_Pos           MS_CTL_1_2_DMAC1_MSC_ACG_CTL_SEC_RESP_Pos
#define MS_CTL_DMAC1_MSC_ACG_CTL_SEC_RESP_Msk           MS_CTL_1_2_DMAC1_MSC_ACG_CTL_SEC_RESP_Msk
#endif

/*******************************************************************************
*                MXSRAMC
*******************************************************************************/
#define MXSRAMC_STATUS                                 (((RAMC_Type *) RAMC0_BASE)->STATUS)
#define MXSRAMC_PWR_MACRO_CTL                          (((RAMC_Type *) RAMC0_BASE)->PWR_MACRO_CTL)
#define MXSRAMC_PWR_MACRO_CTL_LOCK                     (((RAMC_Type *) RAMC0_BASE)->PWR_MACRO_CTL_LOCK)


#define MXSRAMC_PWR_MACRO_CTL_LOCK_CLR0                0X00000001U
#define MXSRAMC_PWR_MACRO_CTL_LOCK_CLR1                0X00000002U
#define MXSRAMC_PWR_MACRO_CTL_LOCK_SET01               0X00000003U
#define CY_CPUSS_RAMC0_MACRO_NR                        CPUSS_RAMC0_MACRO_NR

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 8.6');

#endif /* CY_DEVICE_H_ */

/* [] END OF FILE */

